; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	spectrograph4 - mode
	thermograph1 - mode
	thermograph0 - mode
	image2 - mode
	spectrograph3 - mode
	GroundStation8 - direction
	Star9 - direction
	GroundStation10 - direction
	GroundStation6 - direction
	Star7 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	GroundStation5 - direction
	Star1 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Star13 - direction
	Star14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph4)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 image2)
	(supports instrument1 spectrograph4)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 Star7)
	(calibration_target instrument1 GroundStation6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon11)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 GroundStation4)
	(supports instrument3 spectrograph4)
	(supports instrument3 thermograph1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star1)
	(calibration_target instrument3 GroundStation5)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon11)
	(supports instrument4 image2)
	(supports instrument4 thermograph0)
	(supports instrument4 spectrograph4)
	(calibration_target instrument4 GroundStation0)
	(calibration_target instrument4 GroundStation3)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star14)
)
(:goal (and
	(pointing satellite1 GroundStation2)
	(have_image Phenomenon11 spectrograph4)
	(have_image Planet12 spectrograph4)
	(have_image Star13 image2)
	(have_image Star14 spectrograph3)
	(have_image Star15 thermograph0)
))

)

; plan
1. (turn_to satellite1 groundstation0 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 groundstation0)
   goals met: 0 of 6
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 6
3. (calibrate satellite1 instrument3 groundstation0)
   added: (calibrated instrument3)
   goals met: 0 of 6
4. (turn_to satellite1 phenomenon11 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon11)
   goals met: 0 of 6
5. (turn_to satellite0 groundstation6 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 groundstation6)
   goals met: 0 of 6
6. (take_image satellite1 phenomenon11 instrument3 spectrograph4)
   added: (have_image phenomenon11 spectrograph4)
   goals met: 1 of 6
7. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 6
8. (calibrate satellite0 instrument1 groundstation6)
   added: (calibrated instrument1)
   goals met: 1 of 6
9. (turn_to satellite0 planet12 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 planet12)
   goals met: 1 of 6
10. (take_image satellite0 planet12 instrument1 spectrograph4)
   added: (have_image planet12 spectrograph4)
   goals met: 2 of 6
11. (turn_to satellite0 star13 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star13)
   goals met: 2 of 6
12. (take_image satellite0 star13 instrument1 image2)
   added: (have_image star13 image2)
   goals met: 3 of 6
13. (turn_to satellite0 star14 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star14)
   goals met: 3 of 6
14. (take_image satellite0 star14 instrument1 spectrograph3)
   added: (have_image star14 spectrograph3)
   goals met: 4 of 6
15. (turn_to satellite1 star15 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 star15)
   goals met: 4 of 6
16. (take_image satellite1 star15 instrument3 thermograph0)
   added: (have_image star15 thermograph0)
   goals met: 5 of 6
17. (turn_to satellite1 groundstation2 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 groundstation2)
   goals met: 6 of 6
